In [2]:
import pyodbc

In [3]:
pyodbc.drivers()

['ODBC Driver 17 for SQL Server']

In [4]:
conection = "DRIVER={ODBC Driver 17 for SQL Server}; SERVER=localhost,1433; DATABASE=Resturant; UID=SA; PWD=YourStrongPassw0rd"

In [5]:
conection

'DRIVER={ODBC Driver 17 for SQL Server}; SERVER=localhost,1433; DATABASE=Resturant; UID=SA; PWD=YourStrongPassw0rd'

In [7]:
query = "SELECT delivery_city, COUNT(*) AS city_count FROM [Resturant].[dbo].[city_addresses] GROUP BY delivery_city ORDER BY city_count DESC;"

In [6]:
conn = conx = pyodbc.connect(conection);

In [8]:
cursor = conn.cursor();

In [9]:
cursor.execute(query);

In [10]:
data = cursor.fetchall()

In [11]:
data

[('Austin', 23),
 ('Houston', 22),
 ('Fort Worth', 19),
 ('San Antonio', 18),
 ('Dallas', 18)]

In [12]:
conx.close()

"DRIVER={ODBC Driver 17 for SQL Server}; SERVER=localhost,1433; DATABASE=Resturant; UID=SA; PWD=YourStrongPassw0rd"

In [13]:
import pyodbc

def test_connection():
    try:
        conn = pyodbc.connect(
            "DRIVER={ODBC Driver 17 for SQL Server};"
            "SERVER=localhost,1433;"
            "DATABASE=Resturant;"
            "UID=SA;"
            "PWD=YourStrongPassw0rd"
        )
        cursor = conn.cursor()
        cursor.execute("SELECT 1")  # Simple query to test connection
        result = cursor.fetchone()
        print("Connection successful! Test query result:", result)
        conn.close()
    except Exception as e:
        print("Connection failed:", str(e))

test_connection()

Connection successful! Test query result: (1,)

In [14]:
query = """
        SELECT item_name, SUM(o.quantity) AS total_sold
        FROM [Resturant].[dbo].[order] o
        JOIN [Resturant].[dbo].[iteam-2] i ON o.item_id = i.item_id
        GROUP BY i.item_name
        ORDER BY total_sold DESC;
    """

In [16]:
import pandas as pd

In [18]:
df = pd.read_sql(query, conn)
conn.close()

/var/folders/2m/53v2qwy10g564nj5mjr0w0nc0000gn/T/ipykernel_96894/2049290334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

ProgrammingError: Attempt to use a closed connection.

In [34]:
def get_city_data():
    conn = pyodbc.connect(
        "DRIVER={ODBC Driver 17 for SQL Server};"
        "SERVER=localhost,1433;"
        "DATABASE=Resturant;"
        "UID=SA;"
        "PWD=YourStrongPassw0rd"
    )
    query = """
        select ([Resturant].[dbo].[order].quantity * [Resturant].[dbo].[iteam-2].price) as total
        from [Resturant].[dbo].[order]
        join [Resturant].[dbo].[iteam-2] on [Resturant].[dbo].[order].[item_id] = [Resturant].[dbo].[iteam-2].[item_id]
    """
    df = pd.read_sql(query, conn)
    conn.close()
    return df

In [35]:
get_city_data()

/var/folders/2m/53v2qwy10g564nj5mjr0w0nc0000gn/T/ipykernel_96894/1546853602.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

     total
0     2.99
1     7.47
2     2.99
3    11.96
4    26.97
..     ...
450  26.97
451  41.97
452  21.49
453  34.47
454  17.97

[455 rows x 1 columns]

In [45]:
def get_price_data():
    conn = pyodbc.connect(
        "DRIVER={ODBC Driver 17 for SQL Server};"
        "SERVER=localhost,1433;"
        "DATABASE=Resturant;"
        "UID=SA;"
        "PWD=YourStrongPassw0rd"
    )
    query = """
        select avg([Resturant].[dbo].[order].quantity * [Resturant].[dbo].[iteam-2].price) as average_order_value
        from [Resturant].[dbo].[order]
        join [Resturant].[dbo].[iteam-2] on [Resturant].[dbo].[order].[item_id] = [Resturant].[dbo].[iteam-2].[item_id]
    """
    df = pd.read_sql(query, conn)
    conn.close()
    return df

In [46]:
get_price_data()

/var/folders/2m/53v2qwy10g564nj5mjr0w0nc0000gn/T/ipykernel_96894/4245926754.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   average_order_value
0            49.696087

In [51]:
def get_price_data():
    conn = pyodbc.connect(
        "DRIVER={ODBC Driver 17 for SQL Server};"
        "SERVER=localhost,1433;"
        "DATABASE=Resturant;"
        "UID=SA;"
        "PWD=YourStrongPassw0rd"
    )
    query = """
    SELECT 
    CONVERT(date, [Resturant].[dbo].[order].created_at) AS order_date,
    SUM([Resturant].[dbo].[order].quantity * [Resturant].[dbo].[iteam-2].price) AS sales
    FROM 
    [Resturant].[dbo].[order]
    JOIN [Resturant].[dbo].[iteam-2] ON [Resturant].[dbo].[order].[item_id] = [Resturant].[dbo].[iteam-2].[item_id]
    GROUP BY CONVERT(date, [Resturant].[dbo].[order].created_at)
    ORDER BY order_date;
    """
    df = pd.read_sql(query, conn)
    conn.close()
    return df

In [52]:
get_price_data()

/var/folders/2m/53v2qwy10g564nj5mjr0w0nc0000gn/T/ipykernel_96894/1029511988.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

    order_date    sales
0   2025-01-07  1099.66
1   2025-01-08   773.98
2   2025-01-10   169.76
3   2025-01-11  1203.84
4   2025-01-12   359.28
5   2025-01-13    81.92
6   2025-01-14   765.81
7   2025-01-15  1797.48
8   2025-01-16   934.84
9   2025-01-17   222.55
10  2025-01-18  1214.24
11  2025-01-19   385.00
12  2025-01-20   385.36
13  2025-01-21   159.68
14  2025-01-22   873.11
15  2025-01-23  1236.44
16  2025-01-24   199.60
17  2025-01-25  1536.77
18  2025-01-26   538.40
19  2025-01-27   619.22
20  2025-01-28  1654.90
21  2025-01-29   550.32
22  2025-01-31   637.00
23  2025-02-01   741.66
24  2025-02-02   377.68
25  2025-02-03  1136.64
26  2025-02-04   560.02
27  2025-02-05  1255.06
28  2025-02-06   791.18
29  2025-02-17    23.92
30  2025-03-21   119.76
31  2025-04-14   161.82
32  2025-04-25    44.82